###################################################################

# Created by write_sdc on Fri Apr 25 06:44:47 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_load -pin_load 1.5 [get_ports {res[15]}]
set_load -pin_load 1.5 [get_ports {res[14]}]
set_load -pin_load 1.5 [get_ports {res[13]}]
set_load -pin_load 1.5 [get_ports {res[12]}]
set_load -pin_load 1.5 [get_ports {res[11]}]
set_load -pin_load 1.5 [get_ports {res[10]}]
set_load -pin_load 1.5 [get_ports {res[9]}]
set_load -pin_load 1.5 [get_ports {res[8]}]
set_load -pin_load 1.5 [get_ports {res[7]}]
set_load -pin_load 1.5 [get_ports {res[6]}]
set_load -pin_load 1.5 [get_ports {res[5]}]
set_load -pin_load 1.5 [get_ports {res[4]}]
set_load -pin_load 1.5 [get_ports {res[3]}]
set_load -pin_load 1.5 [get_ports {res[2]}]
set_load -pin_load 1.5 [get_ports {res[1]}]
set_load -pin_load 1.5 [get_ports {res[0]}]
create_clock [get_ports clk]  -period 0.9  -waveform {0 0.45}
set_clock_uncertainty 0.045  [get_clocks clk]
set_input_delay -clock clk  0.027  [get_ports clk]
set_input_delay -clock clk  0.027  [get_ports rst_n]
set_input_delay -clock clk  0.027  [get_ports en]
set_input_delay -clock clk  0.027  [get_ports {A_in[15]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[14]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[13]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[12]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[11]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[10]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[9]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[8]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[7]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[6]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[5]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[4]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[3]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[2]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[1]}]
set_input_delay -clock clk  0.027  [get_ports {A_in[0]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[15]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[14]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[13]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[12]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[11]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[10]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[9]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[8]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[7]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[6]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[5]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[4]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[3]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[2]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[1]}]
set_input_delay -clock clk  0.027  [get_ports {B_in[0]}]
set_output_delay -clock clk  0.036  [get_ports {res[15]}]
set_output_delay -clock clk  0.036  [get_ports {res[14]}]
set_output_delay -clock clk  0.036  [get_ports {res[13]}]
set_output_delay -clock clk  0.036  [get_ports {res[12]}]
set_output_delay -clock clk  0.036  [get_ports {res[11]}]
set_output_delay -clock clk  0.036  [get_ports {res[10]}]
set_output_delay -clock clk  0.036  [get_ports {res[9]}]
set_output_delay -clock clk  0.036  [get_ports {res[8]}]
set_output_delay -clock clk  0.036  [get_ports {res[7]}]
set_output_delay -clock clk  0.036  [get_ports {res[6]}]
set_output_delay -clock clk  0.036  [get_ports {res[5]}]
set_output_delay -clock clk  0.036  [get_ports {res[4]}]
set_output_delay -clock clk  0.036  [get_ports {res[3]}]
set_output_delay -clock clk  0.036  [get_ports {res[2]}]
set_output_delay -clock clk  0.036  [get_ports {res[1]}]
set_output_delay -clock clk  0.036  [get_ports {res[0]}]
