###################################################################

# Created by write_sdc on Sat Apr 26 00:17:50 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_load -pin_load 1.5 [get_ports {res[31]}]
set_load -pin_load 1.5 [get_ports {res[30]}]
set_load -pin_load 1.5 [get_ports {res[29]}]
set_load -pin_load 1.5 [get_ports {res[28]}]
set_load -pin_load 1.5 [get_ports {res[27]}]
set_load -pin_load 1.5 [get_ports {res[26]}]
set_load -pin_load 1.5 [get_ports {res[25]}]
set_load -pin_load 1.5 [get_ports {res[24]}]
set_load -pin_load 1.5 [get_ports {res[23]}]
set_load -pin_load 1.5 [get_ports {res[22]}]
set_load -pin_load 1.5 [get_ports {res[21]}]
set_load -pin_load 1.5 [get_ports {res[20]}]
set_load -pin_load 1.5 [get_ports {res[19]}]
set_load -pin_load 1.5 [get_ports {res[18]}]
set_load -pin_load 1.5 [get_ports {res[17]}]
set_load -pin_load 1.5 [get_ports {res[16]}]
set_load -pin_load 1.5 [get_ports {res[15]}]
set_load -pin_load 1.5 [get_ports {res[14]}]
set_load -pin_load 1.5 [get_ports {res[13]}]
set_load -pin_load 1.5 [get_ports {res[12]}]
set_load -pin_load 1.5 [get_ports {res[11]}]
set_load -pin_load 1.5 [get_ports {res[10]}]
set_load -pin_load 1.5 [get_ports {res[9]}]
set_load -pin_load 1.5 [get_ports {res[8]}]
set_load -pin_load 1.5 [get_ports {res[7]}]
set_load -pin_load 1.5 [get_ports {res[6]}]
set_load -pin_load 1.5 [get_ports {res[5]}]
set_load -pin_load 1.5 [get_ports {res[4]}]
set_load -pin_load 1.5 [get_ports {res[3]}]
set_load -pin_load 1.5 [get_ports {res[2]}]
set_load -pin_load 1.5 [get_ports {res[1]}]
set_load -pin_load 1.5 [get_ports {res[0]}]
create_clock [get_ports clk]  -period 1.38  -waveform {0 0.69}
set_clock_uncertainty 0.069  [get_clocks clk]
set_input_delay -clock clk  0.0414  [get_ports clk]
set_input_delay -clock clk  0.0414  [get_ports rst_n]
set_input_delay -clock clk  0.0414  [get_ports en]
set_input_delay -clock clk  0.0414  [get_ports {A_in[31]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[30]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[29]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[28]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[27]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[26]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[25]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[24]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[23]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[22]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[21]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[20]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[19]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[18]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[17]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[16]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[15]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[14]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[13]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[12]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[11]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[10]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[9]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[8]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[7]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[6]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[5]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[4]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[3]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[2]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[1]}]
set_input_delay -clock clk  0.0414  [get_ports {A_in[0]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[31]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[30]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[29]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[28]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[27]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[26]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[25]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[24]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[23]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[22]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[21]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[20]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[19]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[18]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[17]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[16]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[15]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[14]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[13]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[12]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[11]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[10]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[9]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[8]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[7]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[6]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[5]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[4]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[3]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[2]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[1]}]
set_input_delay -clock clk  0.0414  [get_ports {B_in[0]}]
set_output_delay -clock clk  0.0552  [get_ports {res[31]}]
set_output_delay -clock clk  0.0552  [get_ports {res[30]}]
set_output_delay -clock clk  0.0552  [get_ports {res[29]}]
set_output_delay -clock clk  0.0552  [get_ports {res[28]}]
set_output_delay -clock clk  0.0552  [get_ports {res[27]}]
set_output_delay -clock clk  0.0552  [get_ports {res[26]}]
set_output_delay -clock clk  0.0552  [get_ports {res[25]}]
set_output_delay -clock clk  0.0552  [get_ports {res[24]}]
set_output_delay -clock clk  0.0552  [get_ports {res[23]}]
set_output_delay -clock clk  0.0552  [get_ports {res[22]}]
set_output_delay -clock clk  0.0552  [get_ports {res[21]}]
set_output_delay -clock clk  0.0552  [get_ports {res[20]}]
set_output_delay -clock clk  0.0552  [get_ports {res[19]}]
set_output_delay -clock clk  0.0552  [get_ports {res[18]}]
set_output_delay -clock clk  0.0552  [get_ports {res[17]}]
set_output_delay -clock clk  0.0552  [get_ports {res[16]}]
set_output_delay -clock clk  0.0552  [get_ports {res[15]}]
set_output_delay -clock clk  0.0552  [get_ports {res[14]}]
set_output_delay -clock clk  0.0552  [get_ports {res[13]}]
set_output_delay -clock clk  0.0552  [get_ports {res[12]}]
set_output_delay -clock clk  0.0552  [get_ports {res[11]}]
set_output_delay -clock clk  0.0552  [get_ports {res[10]}]
set_output_delay -clock clk  0.0552  [get_ports {res[9]}]
set_output_delay -clock clk  0.0552  [get_ports {res[8]}]
set_output_delay -clock clk  0.0552  [get_ports {res[7]}]
set_output_delay -clock clk  0.0552  [get_ports {res[6]}]
set_output_delay -clock clk  0.0552  [get_ports {res[5]}]
set_output_delay -clock clk  0.0552  [get_ports {res[4]}]
set_output_delay -clock clk  0.0552  [get_ports {res[3]}]
set_output_delay -clock clk  0.0552  [get_ports {res[2]}]
set_output_delay -clock clk  0.0552  [get_ports {res[1]}]
set_output_delay -clock clk  0.0552  [get_ports {res[0]}]
