###################################################################

# Created by write_sdc on Thu Feb 24 15:33:53 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_load -pin_load 1.5 [get_ports {out[2]}]
set_load -pin_load 1.5 [get_ports {out[1]}]
set_load -pin_load 1.5 [get_ports {out[0]}]
set_load -pin_load 1.5 [get_ports b]
set_load -pin_load 1.5 [get_ports {out32[31]}]
set_load -pin_load 1.5 [get_ports {out32[30]}]
set_load -pin_load 1.5 [get_ports {out32[29]}]
set_load -pin_load 1.5 [get_ports {out32[28]}]
set_load -pin_load 1.5 [get_ports {out32[27]}]
set_load -pin_load 1.5 [get_ports {out32[26]}]
set_load -pin_load 1.5 [get_ports {out32[25]}]
set_load -pin_load 1.5 [get_ports {out32[24]}]
set_load -pin_load 1.5 [get_ports {out32[23]}]
set_load -pin_load 1.5 [get_ports {out32[22]}]
set_load -pin_load 1.5 [get_ports {out32[21]}]
set_load -pin_load 1.5 [get_ports {out32[20]}]
set_load -pin_load 1.5 [get_ports {out32[19]}]
set_load -pin_load 1.5 [get_ports {out32[18]}]
set_load -pin_load 1.5 [get_ports {out32[17]}]
set_load -pin_load 1.5 [get_ports {out32[16]}]
set_load -pin_load 1.5 [get_ports {out32[15]}]
set_load -pin_load 1.5 [get_ports {out32[14]}]
set_load -pin_load 1.5 [get_ports {out32[13]}]
set_load -pin_load 1.5 [get_ports {out32[12]}]
set_load -pin_load 1.5 [get_ports {out32[11]}]
set_load -pin_load 1.5 [get_ports {out32[10]}]
set_load -pin_load 1.5 [get_ports {out32[9]}]
set_load -pin_load 1.5 [get_ports {out32[8]}]
set_load -pin_load 1.5 [get_ports {out32[7]}]
set_load -pin_load 1.5 [get_ports {out32[6]}]
set_load -pin_load 1.5 [get_ports {out32[5]}]
set_load -pin_load 1.5 [get_ports {out32[4]}]
set_load -pin_load 1.5 [get_ports {out32[3]}]
set_load -pin_load 1.5 [get_ports {out32[2]}]
set_load -pin_load 1.5 [get_ports {out32[1]}]
set_load -pin_load 1.5 [get_ports {out32[0]}]
create_clock [get_ports clk]  -period 4  -waveform {0 2}
set_clock_uncertainty 0.2  [get_clocks clk]
set_input_delay -clock clk  0.12  [get_ports clk]
set_input_delay -clock clk  0.12  [get_ports {in0[1]}]
set_input_delay -clock clk  0.12  [get_ports {in0[0]}]
set_input_delay -clock clk  0.12  [get_ports {in1[1]}]
set_input_delay -clock clk  0.12  [get_ports {in1[0]}]
set_input_delay -clock clk  0.12  [get_ports a]
set_input_delay -clock clk  0.12  [get_ports {in31a[30]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[29]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[28]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[27]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[26]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[25]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[24]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[23]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[22]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[21]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[20]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[19]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[18]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[17]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[16]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[15]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[14]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[13]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[12]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[11]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[10]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[9]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[8]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[7]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[6]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[5]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[4]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[3]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[2]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[1]}]
set_input_delay -clock clk  0.12  [get_ports {in31a[0]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[30]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[29]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[28]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[27]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[26]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[25]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[24]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[23]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[22]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[21]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[20]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[19]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[18]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[17]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[16]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[15]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[14]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[13]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[12]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[11]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[10]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[9]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[8]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[7]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[6]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[5]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[4]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[3]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[2]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[1]}]
set_input_delay -clock clk  0.12  [get_ports {in31b[0]}]
set_input_delay -clock clk  0.12  [get_ports reset]
set_output_delay -clock clk  0.16  [get_ports {out[2]}]
set_output_delay -clock clk  0.16  [get_ports {out[1]}]
set_output_delay -clock clk  0.16  [get_ports {out[0]}]
set_output_delay -clock clk  0.16  [get_ports b]
set_output_delay -clock clk  0.16  [get_ports {out32[31]}]
set_output_delay -clock clk  0.16  [get_ports {out32[30]}]
set_output_delay -clock clk  0.16  [get_ports {out32[29]}]
set_output_delay -clock clk  0.16  [get_ports {out32[28]}]
set_output_delay -clock clk  0.16  [get_ports {out32[27]}]
set_output_delay -clock clk  0.16  [get_ports {out32[26]}]
set_output_delay -clock clk  0.16  [get_ports {out32[25]}]
set_output_delay -clock clk  0.16  [get_ports {out32[24]}]
set_output_delay -clock clk  0.16  [get_ports {out32[23]}]
set_output_delay -clock clk  0.16  [get_ports {out32[22]}]
set_output_delay -clock clk  0.16  [get_ports {out32[21]}]
set_output_delay -clock clk  0.16  [get_ports {out32[20]}]
set_output_delay -clock clk  0.16  [get_ports {out32[19]}]
set_output_delay -clock clk  0.16  [get_ports {out32[18]}]
set_output_delay -clock clk  0.16  [get_ports {out32[17]}]
set_output_delay -clock clk  0.16  [get_ports {out32[16]}]
set_output_delay -clock clk  0.16  [get_ports {out32[15]}]
set_output_delay -clock clk  0.16  [get_ports {out32[14]}]
set_output_delay -clock clk  0.16  [get_ports {out32[13]}]
set_output_delay -clock clk  0.16  [get_ports {out32[12]}]
set_output_delay -clock clk  0.16  [get_ports {out32[11]}]
set_output_delay -clock clk  0.16  [get_ports {out32[10]}]
set_output_delay -clock clk  0.16  [get_ports {out32[9]}]
set_output_delay -clock clk  0.16  [get_ports {out32[8]}]
set_output_delay -clock clk  0.16  [get_ports {out32[7]}]
set_output_delay -clock clk  0.16  [get_ports {out32[6]}]
set_output_delay -clock clk  0.16  [get_ports {out32[5]}]
set_output_delay -clock clk  0.16  [get_ports {out32[4]}]
set_output_delay -clock clk  0.16  [get_ports {out32[3]}]
set_output_delay -clock clk  0.16  [get_ports {out32[2]}]
set_output_delay -clock clk  0.16  [get_ports {out32[1]}]
set_output_delay -clock clk  0.16  [get_ports {out32[0]}]
