###################################################################

# Created by write_sdc on Fri Apr 18 02:51:19 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_load -pin_load 1.5 [get_ports {O[31]}]
set_load -pin_load 1.5 [get_ports {O[30]}]
set_load -pin_load 1.5 [get_ports {O[29]}]
set_load -pin_load 1.5 [get_ports {O[28]}]
set_load -pin_load 1.5 [get_ports {O[27]}]
set_load -pin_load 1.5 [get_ports {O[26]}]
set_load -pin_load 1.5 [get_ports {O[25]}]
set_load -pin_load 1.5 [get_ports {O[24]}]
set_load -pin_load 1.5 [get_ports {O[23]}]
set_load -pin_load 1.5 [get_ports {O[22]}]
set_load -pin_load 1.5 [get_ports {O[21]}]
set_load -pin_load 1.5 [get_ports {O[20]}]
set_load -pin_load 1.5 [get_ports {O[19]}]
set_load -pin_load 1.5 [get_ports {O[18]}]
set_load -pin_load 1.5 [get_ports {O[17]}]
set_load -pin_load 1.5 [get_ports {O[16]}]
set_load -pin_load 1.5 [get_ports {O[15]}]
set_load -pin_load 1.5 [get_ports {O[14]}]
set_load -pin_load 1.5 [get_ports {O[13]}]
set_load -pin_load 1.5 [get_ports {O[12]}]
set_load -pin_load 1.5 [get_ports {O[11]}]
set_load -pin_load 1.5 [get_ports {O[10]}]
set_load -pin_load 1.5 [get_ports {O[9]}]
set_load -pin_load 1.5 [get_ports {O[8]}]
set_load -pin_load 1.5 [get_ports {O[7]}]
set_load -pin_load 1.5 [get_ports {O[6]}]
set_load -pin_load 1.5 [get_ports {O[5]}]
set_load -pin_load 1.5 [get_ports {O[4]}]
set_load -pin_load 1.5 [get_ports {O[3]}]
set_load -pin_load 1.5 [get_ports {O[2]}]
set_load -pin_load 1.5 [get_ports {O[1]}]
set_load -pin_load 1.5 [get_ports {O[0]}]
create_clock [get_ports clk]  -period 2.9  -waveform {0 1.45}
set_clock_uncertainty 0.145  [get_clocks clk]
set_input_delay -clock clk  0.087  [get_ports clk]
set_input_delay -clock clk  0.087  [get_ports {A[31]}]
set_input_delay -clock clk  0.087  [get_ports {A[30]}]
set_input_delay -clock clk  0.087  [get_ports {A[29]}]
set_input_delay -clock clk  0.087  [get_ports {A[28]}]
set_input_delay -clock clk  0.087  [get_ports {A[27]}]
set_input_delay -clock clk  0.087  [get_ports {A[26]}]
set_input_delay -clock clk  0.087  [get_ports {A[25]}]
set_input_delay -clock clk  0.087  [get_ports {A[24]}]
set_input_delay -clock clk  0.087  [get_ports {A[23]}]
set_input_delay -clock clk  0.087  [get_ports {A[22]}]
set_input_delay -clock clk  0.087  [get_ports {A[21]}]
set_input_delay -clock clk  0.087  [get_ports {A[20]}]
set_input_delay -clock clk  0.087  [get_ports {A[19]}]
set_input_delay -clock clk  0.087  [get_ports {A[18]}]
set_input_delay -clock clk  0.087  [get_ports {A[17]}]
set_input_delay -clock clk  0.087  [get_ports {A[16]}]
set_input_delay -clock clk  0.087  [get_ports {A[15]}]
set_input_delay -clock clk  0.087  [get_ports {A[14]}]
set_input_delay -clock clk  0.087  [get_ports {A[13]}]
set_input_delay -clock clk  0.087  [get_ports {A[12]}]
set_input_delay -clock clk  0.087  [get_ports {A[11]}]
set_input_delay -clock clk  0.087  [get_ports {A[10]}]
set_input_delay -clock clk  0.087  [get_ports {A[9]}]
set_input_delay -clock clk  0.087  [get_ports {A[8]}]
set_input_delay -clock clk  0.087  [get_ports {A[7]}]
set_input_delay -clock clk  0.087  [get_ports {A[6]}]
set_input_delay -clock clk  0.087  [get_ports {A[5]}]
set_input_delay -clock clk  0.087  [get_ports {A[4]}]
set_input_delay -clock clk  0.087  [get_ports {A[3]}]
set_input_delay -clock clk  0.087  [get_ports {A[2]}]
set_input_delay -clock clk  0.087  [get_ports {A[1]}]
set_input_delay -clock clk  0.087  [get_ports {A[0]}]
set_input_delay -clock clk  0.087  [get_ports {B[31]}]
set_input_delay -clock clk  0.087  [get_ports {B[30]}]
set_input_delay -clock clk  0.087  [get_ports {B[29]}]
set_input_delay -clock clk  0.087  [get_ports {B[28]}]
set_input_delay -clock clk  0.087  [get_ports {B[27]}]
set_input_delay -clock clk  0.087  [get_ports {B[26]}]
set_input_delay -clock clk  0.087  [get_ports {B[25]}]
set_input_delay -clock clk  0.087  [get_ports {B[24]}]
set_input_delay -clock clk  0.087  [get_ports {B[23]}]
set_input_delay -clock clk  0.087  [get_ports {B[22]}]
set_input_delay -clock clk  0.087  [get_ports {B[21]}]
set_input_delay -clock clk  0.087  [get_ports {B[20]}]
set_input_delay -clock clk  0.087  [get_ports {B[19]}]
set_input_delay -clock clk  0.087  [get_ports {B[18]}]
set_input_delay -clock clk  0.087  [get_ports {B[17]}]
set_input_delay -clock clk  0.087  [get_ports {B[16]}]
set_input_delay -clock clk  0.087  [get_ports {B[15]}]
set_input_delay -clock clk  0.087  [get_ports {B[14]}]
set_input_delay -clock clk  0.087  [get_ports {B[13]}]
set_input_delay -clock clk  0.087  [get_ports {B[12]}]
set_input_delay -clock clk  0.087  [get_ports {B[11]}]
set_input_delay -clock clk  0.087  [get_ports {B[10]}]
set_input_delay -clock clk  0.087  [get_ports {B[9]}]
set_input_delay -clock clk  0.087  [get_ports {B[8]}]
set_input_delay -clock clk  0.087  [get_ports {B[7]}]
set_input_delay -clock clk  0.087  [get_ports {B[6]}]
set_input_delay -clock clk  0.087  [get_ports {B[5]}]
set_input_delay -clock clk  0.087  [get_ports {B[4]}]
set_input_delay -clock clk  0.087  [get_ports {B[3]}]
set_input_delay -clock clk  0.087  [get_ports {B[2]}]
set_input_delay -clock clk  0.087  [get_ports {B[1]}]
set_input_delay -clock clk  0.087  [get_ports {B[0]}]
set_input_delay -clock clk  0.087  [get_ports {S[1]}]
set_input_delay -clock clk  0.087  [get_ports {S[0]}]
set_output_delay -clock clk  0.116  [get_ports {O[31]}]
set_output_delay -clock clk  0.116  [get_ports {O[30]}]
set_output_delay -clock clk  0.116  [get_ports {O[29]}]
set_output_delay -clock clk  0.116  [get_ports {O[28]}]
set_output_delay -clock clk  0.116  [get_ports {O[27]}]
set_output_delay -clock clk  0.116  [get_ports {O[26]}]
set_output_delay -clock clk  0.116  [get_ports {O[25]}]
set_output_delay -clock clk  0.116  [get_ports {O[24]}]
set_output_delay -clock clk  0.116  [get_ports {O[23]}]
set_output_delay -clock clk  0.116  [get_ports {O[22]}]
set_output_delay -clock clk  0.116  [get_ports {O[21]}]
set_output_delay -clock clk  0.116  [get_ports {O[20]}]
set_output_delay -clock clk  0.116  [get_ports {O[19]}]
set_output_delay -clock clk  0.116  [get_ports {O[18]}]
set_output_delay -clock clk  0.116  [get_ports {O[17]}]
set_output_delay -clock clk  0.116  [get_ports {O[16]}]
set_output_delay -clock clk  0.116  [get_ports {O[15]}]
set_output_delay -clock clk  0.116  [get_ports {O[14]}]
set_output_delay -clock clk  0.116  [get_ports {O[13]}]
set_output_delay -clock clk  0.116  [get_ports {O[12]}]
set_output_delay -clock clk  0.116  [get_ports {O[11]}]
set_output_delay -clock clk  0.116  [get_ports {O[10]}]
set_output_delay -clock clk  0.116  [get_ports {O[9]}]
set_output_delay -clock clk  0.116  [get_ports {O[8]}]
set_output_delay -clock clk  0.116  [get_ports {O[7]}]
set_output_delay -clock clk  0.116  [get_ports {O[6]}]
set_output_delay -clock clk  0.116  [get_ports {O[5]}]
set_output_delay -clock clk  0.116  [get_ports {O[4]}]
set_output_delay -clock clk  0.116  [get_ports {O[3]}]
set_output_delay -clock clk  0.116  [get_ports {O[2]}]
set_output_delay -clock clk  0.116  [get_ports {O[1]}]
set_output_delay -clock clk  0.116  [get_ports {O[0]}]
